app/views/admin/items/edit.html.erb

SELECT "genres".* FROM "genres"
---
  <h4>ジャンル</h4>
     <%= f.collection_select :genre_id, Genre.all, :id, :name %>