app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
      <%= f.label :genre_id, "ジャンル", class: 'col-xl-3 col-form-label' %>
      <%= f.collection_select :genre_id, Genre.all, :id, :name, { prompt: '選択してください' }, class: 'col-xl-5 col-form-label' %>