app/views/admin/items/new.html.erb

  <h4>ジャンル</h4>
     <%= f.collection_select :genre_id, Genre.all, :id, :name, include_blank: "選択して下さい" %>
---
SELECT "genres".* FROM "genres"