app/controllers/admin/customers_controller.rb

  def index
    @customers = Customer.all.page(params[:page]).per(10)
---
SELECT  "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def edit
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    customer = Customer.find(params[:id])
    customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "first_name" = ?, "last_name" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["first_name", "良子"], ["last_name", "例え"], ["address", "東京都渋谷区123"], ["telephone_number", "0000000000"], ["updated_at", "2021-10-22 23:23:04.389679"], ["id", 1]]