app/controllers/admin/genres_controller.rb

SELECT  "genres".* FROM "genres" ORDER BY "genres"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @genre = Genre.new
    @genres = Genre.all.page(params[:page]).per(10)

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ショートケーキ"], ["created_at", "2021-10-22 13:53:25.915058"], ["updated_at", "2021-10-22 13:53:25.915058"]]
SELECT "genres".* FROM "genres"
---
  def create
    @genre = Genre.new(genre_params)
    if @genre.save
      redirect_to admin_genres_path
    else
      @genres = Genre.all.page(params[:page]).per(10)

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @genre = Genre.find(params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "ケーキ4"], ["updated_at", "2021-11-07 04:27:46.901896"], ["id", 1]]
---
  def update
    genre = Genre.find(params[:id])
    genre.update(genre_params)