app/controllers/admin/homes_controller.rb

  def top
    @orders = Order.all.reverse_order.page(params[:page]).per(10)
---
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders"