app/controllers/admin/items_controller.rb

  def index
    @items = Item.all.reverse_order.page(params[:page]).per(10)
---
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"

  def create
    item = Item.new(item_params)
    item.save
---
INSERT INTO "items" ("genre_id", "name", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["name", "ひよこのショートケーキ"], ["introduction", "ああああ"], ["price", "2000"], ["created_at", "2021-10-22 13:55:33.489275"], ["updated_at", "2021-10-22 13:55:33.489275"]]

  def show
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    item = Item.find(params[:id])
    item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "669baae76d79b946f4b429750da94839dd9fcce3f82b2ae3002ef923fc3d"], ["is_active", 1], ["updated_at", "2021-11-06 10:32:58.836973"], ["id", 12]]