app/controllers/admin/order_details_controller.rb

  def update
    order_detail = OrderDetail.find(params[:id])
    order_detail.update(order_detail_params)

    if
      order_detail.make_status == "seisaku"
      order_detail.order.update(status: "sakusei")
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 15]]
UPDATE "order_details" SET "make_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["make_status", 3], ["updated_at", "2021-11-03 13:02:11.400186"], ["id", 6]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]