app/views/admin/orders/show.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <%= form_with model: @order, url:admin_order_path(@order.id), method: :patch, local:true do |f| %>
  <%= f.select :status, Order.statuses_i18n.keys.map{|k| [I18n.t("enums.order.status.#{k}"), k]} %>

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 7]]
---
            <%= form_with model:order_detail, url:admin_order_detail_path, method: :patch, local:true do |f| %>
            <%= f.select :make_status, OrderDetail.make_statuses_i18n.keys.map{|k| [I18n.t("enums.order_detail.make_status.#{k}"), k]} %>