app/views/admin/homes/top.html.erb

SELECT "orders".* FROM "orders"
---
            <td><%= order.customer.full_name %></td>
            <td><%= order.order_details.sum(:amount) %> 個</td>