app/controllers/public/addresses_controller.rb

  def index
    @address = Address.new
    @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

  def create
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 2], ["name", "田中太郎"], ["postal_code", "9876543"], ["address", "東京都千代田区"], ["created_at", "2021-10-27 04:56:35.862688"], ["updated_at", "2021-10-27 04:56:35.862688"]]

  def show
    @address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    address = Address.find(params[:id])
    address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "東京都千代田区　変更"], ["updated_at", "2021-10-30 01:28:40.356807"], ["id", 1]]

  def destroy
    @address = Address.find(params[:id])
    address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 2]]