app/controllers/public/cart_items_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def index
    @customer = Customer.find(current_customer.id)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2021-11-14 07:25:59.213245"], ["id", 20]]
---
  def update
    cart_item = CartItem.find(params[:id])
    cart_item.update(cart_item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 13]]
---
  def destroy
    cart_item = CartItem.find(params[:id])
    cart_item.destroy

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 10]]
---
  def destroy_all
    @customer = Customer.find(current_customer.id)
    @cart_items = @customer.cart_items
    @cart_items.destroy_all

INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 3], ["created_at", "2021-10-29 12:46:44.790810"], ["updated_at", "2021-10-29 12:46:44.790810"]]
---
  def create
    cart_item = CartItem.new(cart_item_params)
    cart_item.save