app/controllers/public/customers_controller.rb

  def edit
    @customer = Customer.find(current_customer.id)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @customer = Customer.find(current_customer.id)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    customer = Customer.find(current_customer.id)
    customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "first_name" = ?, "first_name_kana" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["first_name", "良子てすと"], ["first_name_kana", "ヨシコテスト"], ["updated_at", "2021-10-23 10:52:25.907701"], ["id", 1]]

  def confirm
    @customer = Customer.find(current_customer.id)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def withdraw
    customer = Customer.find(current_customer.id)
    customer.update(is_active: false)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2021-10-23 12:58:28.723236"], ["id", 2]]