app/controllers/public/homes_controller.rb

  def top
    @items = Item.all.page(params[:page]).per(4)
    @genres = Genre.all.page(params[:page]).per(4)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT  "genres".* FROM "genres" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "genres"