app/controllers/public/items_controller.rb

  def index
    @items = Item.all.page(params[:page]).per(8)
    @genres = Genre.all.page(params[:page]).per(4)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
SELECT  "genres".* FROM "genres" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "genres"

  def show
    @genres = Genre.all.page(params[:page]).per(4)
    @item = Item.find(params[:id])
---
SELECT  "genres".* FROM "genres" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "genres"
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]