app/controllers/public/orders_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @customer = Customer.find(current_customer.id)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def confirm

    if params[:order][:address_option] == "0"
        @order = Order.new(order_params)
        @order.mailing_address_postal_code = current_customer.postal_code
        @order.mailing_address = current_customer.address
        @order.mailing_address_name = current_customer.first_name + current_customer.last_name
    elsif params[:order][:address_option] == "1"
        @order = Order.new(order_params)
        @address = Address.find(params[:order][:address_id])
        @order.mailing_address_postal_code = @address.postal_code
        @order.mailing_address = @address.address
        @order.mailing_address_name = @address.name
    elsif params[:order][:address_option] == "2"
        @order = Order.new(order_params)
    end

    @customer = Customer.find(current_customer.id)

INSERT INTO "orders" ("customer_id", "mailing_address_postal_code", "mailing_address", "mailing_address_name", "billing", "postage", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 13], ["item_id", 3], ["price", 2500], ["amount", 2], ["created_at", "2021-11-01 12:37:12.745332"], ["updated_at", "2021-11-01 12:37:12.745332"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 16]]
---
  def create
    @order = Order.new(order_params)
    @order.save

    @cart_items = current_customer.cart_items
    @cart_items.each do |cart_item|
      @order_detail = OrderDetail.new
      @order_detail.order_id = @order.id
      @order_detail.make_status = 0
      @order_detail.item_id = cart_item.item_id
      @order_detail.price = cart_item.item.price
      @order_detail.amount = cart_item.amount
      @order_detail.save
    end
    @cart_items.destroy_all