app/controllers/public/orders_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def confirm
    @customer = Customer.find(current_customer.id)
    @cart_items = @customer.cart_items
    @sum = 0
    @item = Item.find(params[:id])