app/controllers/public/sessions_controller.rb

  def reject_inactive_user
    @customer = Customer.find_by(email: params[:customer][:email])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "bbb@bbb"], ["LIMIT", 1]]